artillery/hello.1.yml
config:
  target: "http://13.57.25.19:3004/api/restaurants"
  phases:
    - duration: 60
      arrivalRate: 10
  processor: './random.1.js'
scenarios:
  - name: "recommendations test"
    flow:
      - loop:
        - function: 'generateRandomId'
        - get:
            url: "/{{ id }}/recommendations"
        count: 10