artillery/hello.yml
config:
  target: "http://localhost:3004/api/restaurants"
  phases:
    - duration: 60
      arrivalRate: 100
  processor: './random.js'
scenarios:
  - name: "recommendations test"
    flow:
      - loop:
        - function: 'generateRandomId'
        - get:
            url: "/{{ id }}/recommendations"
        count: 10